Constraints may not be created to linked instances using Shared Locations. Constraints will be removed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoConstraintsToLinks1 { get; }
  Visual Basic
Public Shared ReadOnly Property NoConstraintsToLinks1 As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoConstraintsToLinks1 {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures LinkFailures Class
  Autodesk.Revit.DB Namespace